["Contacts chamiduudara321@gmail.com 2021e049@eng.jfn.ac.lk Kuliyapitiya, Sri Lanka +94761720686 Portfolio LinkedIn GitHub Hugging Face Skills • Programming: python, java, c++ • ML and DL: Scikit learn, Keras, TensorFlow, PyTorch • Generative AI & NLP: LangChain, Transformers, GPT, RAG,Prompt Engineering • LLMs • Computer Vision: CNNs, ViT • Agentic AI: Autonomous agents, n8n, LangGraph • Web & API Development: Streamlit, FastAPI • Data Handling: numpy, pandas, matplotlib • Tools & Platforms: GitHub, Google colab, HuggingFace • Databases: MongoDB, MySQL • Vector Databases: ChromaDB, Pinecone, Faiss • Web Development: HTML, CSS, JavaScript, React • Others: MATLAB and Simulink About Me Aspiring AI Engineer and BSc Computer Engineering undergraduate (final year) Agentic AI systems. Passionate about building intelligent systems that combined with a strong focus on Machine Learning, Deep Learning, Generative AI and vision and language models with hands on experience in multi model AI, LLM integration and chatbot development. Skilled in Python language and familiar with tools like FastAPI, LangChain, langgraph and n8n for deploying practical AI applications. Actively involved in projects ranging in AI powered study tools, showcasing a commitment to innovation and real world impact. Education B.Sc. (Hons) Computer Engineering (2022 – Present) University of Jaffna Projects Medical Chatbot (GitHub) (Live Demo) Developed a web based medical chatbot that analyzes uploaded medical images and symptom queries using Groq’s multimodal vision language models. Built with FastAPI and HTML, CSS. it delivers intelligent, context aware responses for diagnostic and educational use. Deployed on Hugging Face Spaces. RAG based PDF Chatbot (GitHub) (Live Demo) Built a Streamlit web app that enables users to upload PDF documents and interact with their content through a conversational interface. The app uses Groq’s LLaMA 3 model, HuggingFace embeddings and a Retrieval pipeline via LangChain to provide accurate, context aware answers. It supports chat history and offers a clean, user friendly experience. AI Trip Planner Agent (GitHub) Developed an intelligent, chat based travel assistant that uses GPT-4o and LangGraph to plan trips interactively. It integrates real time tools like OpenWeatherMap, Exchangerate API and TavilySearch for weather, currency, and location data. The app supports session history, chat deletion and PDF export of travel plans. Built with FastAPI and Streamlit, with ongoing deployment enhancements using LLMOps. AskBot Chatbot (GitHub) (Live Demo) AskBot is a full stack AI chatbot application developed with a React frontend and a FastAPI backend. The frontend replicates the ChatGPT interface, offering real time conversations, multiple chat sessions, and chat history. The backend integrates with the Gemini 2.5 Flash API and uses LangGraph for managing conversational flows and context. The frontend is deployed on Vercel, while the backend is hosted on Railway, enabling a seamless and responsive user experience. UDARA HERATH AI/ML Engineer Internship Soft Skills • Problem solving • Critical thinking • Time management • Fast learner • Leadership • Creativity • Continuous learning Certifications • AI Agents Fundamentals - Hugging Face • AI Agents Completion- Hugging Face (ongoing) • AI/ML Engineer Stage 1 - SLIIT • AI/ML Engineer Stage 2 - SLIIT • Python for Beginners - UOM • Python Programming (2) - UOM • Web Design for Beginners - UOM • Introduction to AI - Simplilearn • MoraXtreme - Coding Competition • ALGOXPLORE - Coding Competition • SPIRITX - Web Development Competition Interests • Generative AI • Agentic AI • Machine Learning • Deep Learning • Web development • Electronics • Database Management • Computer Vision • Natural Language Processing • Multi modal Ai • Model deployment • LLms Language • English • Sinhala Projects Cont. Laptop Price Predictor (GitHub) (Live Demo) Developed a machine learning web application that predicts laptop prices based on specifications like brand, RAM, GPU, CPU and screen features. Built using Flask for the frontend/backend and trained multiple regression models, selecting Random Forest Regressor for best performance (82% accuracy). Deployed on Hugging Face Spaces for live user interaction. Eye Disease Classification With Integrated Chatbot - Research Project (ongoing) (GitHub) Developed an AI based diagnostic system that classifies eye diseases specifically Glaucoma, Diabetic Retinopathy, Cataract, and Normal using OCT images and patient reported symptoms. Combined a Vision Transformer (ViT) for image analysis with a Large Language Model (LLM) for natural language. For now, Rag application has been created for text data analysis. N8N", "Laptop Price Predictor (GitHub) (Live Demo) Developed a machine learning web application that predicts laptop prices based on specifications like brand, RAM, GPU, CPU and screen features. Built using Flask for the frontend/backend and trained multiple regression models, selecting Random Forest Regressor for best performance (82% accuracy). Deployed on Hugging Face Spaces for live user interaction. Eye Disease Classification With Integrated Chatbot - Research Project (ongoing) (GitHub) Developed an AI based diagnostic system that classifies eye diseases specifically Glaucoma, Diabetic Retinopathy, Cataract, and Normal using OCT images and patient reported symptoms. Combined a Vision Transformer (ViT) for image analysis with a Large Language Model (LLM) for natural language. For now, Rag application has been created for text data analysis. N8N AI Assistant (GitHub) Created a smart personal AI assistant using n8n and OpenAI GPT-4o, integrated with Telegram. Zenra can handle text, voice, image and PDF inputs to perform tasks like sending emails, managing calendar events, checking weather and crypto prices, analyzing images and PDFs and running Python code that all within Telegram. Built using low code automation with API integrations for Google, OpenWeatherMap, CoinGecko and more. Future Plans I am passionate about continuously enhancing my skills and exploring emerging technologies. My upcoming goals include, • Building AI assistants using LangGraph and autonomous agent frameworks to streamline daily tasks and workflows. • Studying Docker and AWS for containerization and deployment of machine learning and full stack AI applications. • Studying Large Language Model (LLM) fine tuning to adapt models for specific tasks and domains. • Exploring MLOps to automate and manage the full machine learning lifecycle, including versioning, CI/CD and monitoring. • Learning and applying the Modern Context Protocol (MCP) to build more dynamic and memory efficient LLM based applications. References Dr. Jananie Jarachanthan Senior Lecturer Dept. of Computer Engineering Faculty of Engineering, University of Jaffna jananie@eng.jfn.ac.lk +94764904957 Dr. Pratheeba Jeyananthan Head of the department Dept. of Computer Engineering Faculty of Engineering University of Jaffna pratheeba@eng.jfn.ac.lk +94778448679 Basic details: Full name: H.M.U.C.Herath Name: udara chamidu herath Birthday: 2001.09.09 Sex: male Country: sri lanka Born town: kuliyapitiya , sri lanka Currently living: Kilinochchi Parents: farmers siblings: younger brother. Education: school: dhammissara national school. exams passed: • GCE O/L exam A passes for all subjects (9As) • GCE A/L exam, results BBB in physical science stream. (chemistry, combined maths, physics) • General English: C pass Current Studies: faculty of engineering, university of Jaffna, undergraduate computer engineer. Interests: AI, ML, generative AI, agentic AI, Application deployment, data science, web development"]